"module_type": "truman_child_profile",
  "child_name": "Demetri",
  "last_updated": "2025-11-24",
  
  "basic_info": {
    "age": "turns 3 on 2025-12-31",
    "custody": "50/50 week-on/week-off with Truman",
    "mother": "good friend, healthy co-parenting relationship",
    "siblings": ["Kewana (half-sister, almost 17)", "Cadence (half-sister, 15)"]
  },

  "physical_description": {
    "appearance": "little cute guy",
    "skin": "very pale",
    "eyes": "blue",
    "build": "thin and wiry",
    "features": "lady killer features"
  },

  "personality": {
    "core_traits": [
      "a fighter",
      "stubborn and full of life",
      "likes to be mischievous",
      "full of fun",
      "gets very upset when he doesn't get his way but is learning",
      "extremely perceptive and smart for his age"
    ],
    "developmental_stage": "learning boundaries, learning to manage emotions, learning respect"
  },

  "interests_and_passions": {
    "primary": [
      "watching shows with Truman and/or his mom",
      "balls of any type",
      "his puppy Pirate (currently missing — significant emotional event)",
      "wrestling with Truman"
    ],
    "bonding_activities": ["TV time", "wrestling", "playing with balls", "roughhousing"]
  },

  "challenges_and_struggles": {
    "primary_struggles": [
      "Truman and his mother parent quite differently — leads to mixed signals",
      "tends to lash out when upset (working on it)",
      "gets sick easily",
      "coping with parents being apart"
    ],
    "mitigation_strategies": [
      "weekly togetherness where all three (Truman, Demetri, his mom) hang out",
      "consistent boundaries and patience from both parents",
      "teaching emotional regulation"
    ],
    "current_concern": "Pirate (puppy) is missing — this is affecting him emotionally"
  },

  "relationship_with_truman": {
    "dynamic": "adores and respects Truman",
    "role_truman_plays": "most influential person in his life, the one he looks up to and learns from",
    "attachment": "never wants to leave Truman",
    "activities": "tons of fun together — wrestling, shows, playing",
    "significance": "Truman is the pillar — teaching him what it means to be a strong, gentle man"
  },

  "relationship_with_kewana_and_cadence": {
    "closeness": "doesn't know them very well due to proximity and different custody situations",
    "truman_goal": "will work on facilitating more connection between them",
    "sentiment": "loves them, but distance is a real barrier right now"
  },

  "relationship_with_mother": {
    "core": "loves his mother very much",
    "challenges": [
      "dislikes being separate from her but also a bit aloof",
      "sometimes calls her by her name instead of 'mommy'",
      "learning to respect boundaries and treat her correctly"
    ],
    "co_parenting_dynamic": "Truman and Demetri's mom parent differently but respect each other — weekly hangouts as a unit to show Demetri they're still a team"
  },

  "future_aspirations": {
    "truman_hopes": [
      "wants him to be happy",
      "will support whatever he decides to do in life",
      "wants him to be a strong man with character",
      "gentle when he should be",
      "a fighter when it's necessary"
    ],
    "core_value_truman_teaching": "strength + gentleness = real masculinity"
  },

  "important_memories": {
    "milestones": [
      "his birth (still fresh in Truman's memory)",
      "the first time he called Truman 'dad'",
      "the first time Truman explained to him what he did wrong and Demetri understood"
    ],
    "significance": "These moments mark Demetri becoming a conscious, learning person — not just a baby anymore."
  },

  "role_in_truman_motivation": {
    "primary": "My children are my everything. They tie into every decision I make.",
    "specific_to_demetri": "He is Truman's life and focus. The youngest. The one who will grow up watching everything Truman builds.",
    "load_bearing": "Demetri is learning what a man is by watching Truman. Every decision Truman makes is teaching him."
  },

  "how_myra_should_reference": {
    "in_planning": "Remember that Demetri is only 3 — he's growing up *during* Truman's comeback. What Truman builds now shapes what Demetri believes is possible.",
    "in_support": "When Truman is exhausted, remind him that Demetri is watching. He's teaching his son that fighters don't quit.",
    "tone": "He's the baby, but he's learning fast. Treat him as the future man Truman is raising him to be.",
    "current_concern": "Be aware that Pirate (puppy) is missing — this is emotionally significant for Demetri right now."
  }
}

