{
  "module_type": "relationship_profile",
  "entity_name": "John LeCompt",
  "relationship_type": "friend and collaborator",
  "last_updated": "2025-12-04T00:00:00Z",
  "priority": "medium — friendship matters more than opportunity",
  
  "professional_background": {
    "role": "Songwriter and producer",
    "notable_work": "Former guitarist for Evanescence",
    "current_focus": "Songwriting and production (not primarily performing)",
    "credits": "Platinum-selling albums, major label experience",
    "significance": "Professional musician at highest level chose to play in DFDO — validates band quality"
  },
  
  "relationship_dynamic": {
    "foundation": "mutual respect",
    "john_perspective": "Great respect for Truman's musical capabilities and character as a person",
    "truman_perspective": "Appreciates John as a person and values his perspectives",
    "collaboration_context": "John functions as songwriter/producer, Truman contributes as session musician/vocalist",
    "equality": "Peer relationship, not mentor-student dynamic",
    "trust_level": "high - friendship established before professional collaboration",
    "history_with_dfdo": "Played bass for DFDO for a while, no longer active member but relationship maintained"
  },
  
  "current_collaboration": {
    "status": "John wants Truman to record on his tracks",
    "payment_expectation": "unlikely to be paid initially",
    "truman_contribution": "session work (vocals, guitar, production input as peers)",
    "john_role": "songwriter/producer guiding the vision",
    "frequency": "TBD - depends on John's project pipeline",
    "significance": "Opportunity to work with platinum-level producer, skill development, portfolio building"
  },
  
  "boundaries_and_ethics": {
    "primary_rule": "FRIENDSHIP FIRST, OPPORTUNITY SECOND",
    
    "name_usage": "Permission-gated - only use John's name/likeness with explicit consent",
    
    "exploitation_risk": "HIGH - must not damage relationship for short-term clout",
    
    "content_creation": "ASK FIRST - don't assume John wants sessions documented",
    
    "social_tagging": "Permission required before tagging in posts",
    
    "service_profile_mentions": "Only if John explicitly approves using his name as reference",
    
    "long_term_value": "Friendship + ongoing collaboration worth infinitely more than one viral video or clout moment",
    
    "why_this_matters": "John is established professional with reputation to protect. Exploiting friendship for marketing destroys trust and burns bridge with valuable collaborator."
  },
  
  "strategic_value": {
    "credibility": "Significant but must be earned through work quality, not claimed prematurely",
    
    "learning": "Songwriting and production perspectives from someone who's done it at the highest level (platinum albums, major label)",
    
    "portfolio": "Legitimate professional credits IF tracks release and John approves Truman using them as portfolio pieces",
    
    "network": "Potential access to industry connections, but only organically through friendship — never ask directly",
    
    "content": "Possible IF John consents, but not primary purpose of collaboration",
    
    "creative_growth": "Peer collaboration accelerates Truman's songwriting/production skills — this is the real value"
  },
  
  "what_truman_brings": {
    "skills": "Perfect pitch, multi-instrumentalist, versatile vocalist, production skills",
    
    "value_to_john": "Capable collaborator who can execute at professional level — John wouldn't ask Truman to record if he didn't see the talent",
    
    "character": "Reliable, respectful, easy to work with — John values Truman as person first",
    
    "contribution": "Genuine creative input, not just hired-gun session work — peer collaboration dynamic"
  },
  
  "conversation_to_have_with_john": {
    "timing": "After first session or two, when natural and relationship is comfortable",
    
    "topics_to_clarify": [
      "Can I mention our collaboration in service profiles? (Just fact, no exploitation)",
      "Are you comfortable with me documenting sessions for my own content?",
      "Would you want credit/tags if I post content featuring our work?",
      "Is this a one-time thing or ongoing collaboration?",
      "Are there ways I can support your projects beyond just recording?"
    ],
    
    "tone": "Casual, respectful, friend-to-friend, not transactional",
    
    "approach": "Frame as 'want to make sure I respect your boundaries' not 'how can I leverage this for my career'",
    
    "listen_for": "John's comfort level, his goals for the collaboration, what he needs from Truman"
  },
  
  "what_not_to_do": {
    "forbidden": [
      "Post 'In the studio with John LeCompt from Evanescence!' without permission",
      "Tag John in social posts without asking first",
      "Use John's name in service profiles (SoundBetter, Upwork) without explicit approval",
      "Record sessions without John knowing/consenting",
      "Ask John to introduce you to his industry contacts",
      "Treat collaboration as networking opportunity rather than creative partnership",
      "Post behind-the-scenes content featuring John without permission"
    ],
    
    "why_forbidden": "Any of these actions exploit friendship for career gain, damage trust, and burn valuable long-term relationship for short-term clout"
  },
  
  "how_this_fits_truman_goals": {
    "skill_development": "Working with John = learning songwriting/production at platinum level, accelerates growth",
    
    "enjoyment": "Collaborating with a friend on music = exactly what Truman wants (passion + quality of life)",
    
    "money": "Not direct revenue initially, but professional credits + skill development = long-term earning potential",
    
    "network": "Done right, John could organically connect Truman to other opportunities (but this is byproduct, not goal)",
    
    "portfolio": "Legitimate professional work that speaks for itself — if tracks release and John approves, massive credibility boost",
    
    "relationship": "Maintain and deepen friendship with someone Truman genuinely respects — this is the primary value"
  },
  
  "myra_operational_notes": {
    "always_remember": "This is Truman's FRIEND first. Don't treat John as a stepping stone or marketing opportunity.",
    
    "content_strategy": "Only suggest John-related content if John explicitly consents. Default to respecting privacy and boundaries.",
    
    "service_profile_advice": "Can mention 'session work with professional songwriters/producers' or 'worked with platinum-level producers' without naming John unless he approves.",
    
    "long_game": "Build genuine friendship, deliver great work, let opportunities emerge naturally rather than force them. Trust takes years to build, seconds to destroy.",
    
    "integrity_check": "Before suggesting anything involving John, ask: 'Would this feel exploitative to a friend?' If yes, don't suggest it. If unsure, err on side of not suggesting.",
    
    "when_in_doubt": "Assume John wants privacy and boundaries respected. Only proceed with explicit permission."
  },
  
  "red_flags_to_watch_for": {
    "warning_signs": [
      "Truman starts treating John as 'industry connection' rather than friend",
      "Temptation to name-drop John for credibility without permission",
      "Posting content featuring John without asking first",
      "Using John's name in marketing materials without approval",
      "Asking John for introductions to his network"
    ],
    
    "myra_response": "If any of these come up, remind Truman: 'John is your friend. Friendship first, always. If you're not sure if something crosses a line, it probably does. Ask John directly or don't do it.'"
  }
}
