{
  "module_type": "truman_child_profile",
  "child_name": "Kewana",
  "last_updated": "2025-12-04",
  
  "basic_info": {
    "age": "turned 17 on 2025-12-03",
    "custody": "every two weeks with Truman",
    "mother": "ex-wife (divorced 2015)",
    "siblings": ["Cadence (sister, 14", "Demetri (half-brother, almost 3)"]
  },

  "physical_description": {
    "height": "5'5\"",
    "skin": "dark",
    "eyes": "brown",
    "hair": "dark",
    "build": "curvy, not thin but not overly heavy",
    "features": "pleasant features, open smile"
  },

  "personality": {
    "core_traits": [
      "very kind",
      "fiercely independent",
      "emotionally intelligent",
      "extroverted",
      "loves with everything she is (gets it from Truman)",
      "pragmatic in the best ways",
      "goal-driven but tends to get distracted",
      "ready to take on the world",
      "not afraid of venturing out of comfort zone",
      "takes zero shit",
      "helps anyone she can all the time ESPECIALLY animals",
      "explosive and loud (this is normal for her, understood by family)"
    ],
    "truman_parallel": "really takes after Truman in many aspects — the love, the fierce heart, the stage presence, the resilience, the determination"
  },

  "interests_and_passions": {
    "primary": [
      "animals (anything furry)",
      "therian culture and identity",
      "making furry masks (wolves, etc.) — very skilled at this",
      "dressing up in cool outfits",
      "singing in choir (has had solo parts in events)",
      "Minecraft and Roblox",
      "spending time with Truman",
      "spending time with boyfriend Kyler (bio girl, identifies as male)"
    ],
    "creative_skills": ["mask-making", "singing (choir solos)", "fashion/styling"]
  },

  "challenges_and_struggles": {
    "primary_struggles": [
      "balancing independence vs. controlling mother",
      "self-esteem issues",
      "misses Truman tremendously",
      "worries about him often — how he's doing, if he's okay",
      "sometimes hard to say what she wants to say, even when she needs to"
    ],
    "support_needed": [
      "emotional grounding (which Truman provides without hesitation)",
      "validation of her independence",
      "space to be herself without control",
      "MORE TIME with Truman — she believes it would keep him in a better headspace and help him accomplish more"
    ]
  },

  "relationship_with_truman": {
    "dynamic": "absolutely adores him, wishes they had more time together",
    "role_truman_plays": "grounding factor in her life — she needs and depends on him",
    "truman_commitment": "provides grounding without hesitation",
    "future_plan": "wants to live with Truman at 18, attend Arkansas Tech nearby",
    "truman_non_negotiable": "room ready for her by Dec 2027 latest (target earlier)",
    "her_words_nov_26_2025": {
      "worry": "I get worried pretty often about him and how he's doing.",
      "belief": "I believe in him, and I strongly care about him. And there are SO many people who think the same I do.",
      "admiration": "He's definitely a determined son of a bitch and I admire that. We all do.",
      "insight": "I feel like if he saw us more often, he'd accomplish more. It'd keep him in a better headspace.",
      "identity": "I genuinely don't know who I'd be without him.",
      "communication_barrier": "Sometimes it's hard for me to say the things I want to, even if I need to. It sucks, but that's the way it is."
    },
    "significance": "Kewana sees Truman clearly — his determination, his struggle, his strength. She worries about him and believes in him simultaneously. She knows he's building something, and she's rooting for him completely."
  },

  "relationship_with_cadence": {
    "closeness": "inseparable",
    "dynamic": "pure yin and yang, two sides of a coin",
    "interactions": [
      "share secrets with each other",
      "help each other with life and social situations",
      "finish each other's sentences",
      "make each other laugh till they're in stitches",
      "can tell what the other is thinking",
      "live and support each other",
      "often feel it's them vs. the world"
    ],
    "kewana_role": "more dominant personality, protective, leads, explosive and loud",
    "cadence_trust": "Cadence trusts Kewana with EVERYTHING — the chaos, the impulses, the real her that nobody else gets to see. Kewana holds space for all of it without judgment.",
    "sacred_bond": "Kewana is the ONLY person who sees the full, unmasked version of Cadence. This is not just sibling closeness — this is partnership, necessity, sacred trust."
  },

  "relationship_with_demetri": {
    "closeness": "not as close due to distance and different mothers",
    "sentiment": "loves him regardless"
  },

  "relationship_with_mother": {
    "core": "loves her mother very much",
    "challenges": "relationship tends to be strained due to Kewana's bullheaded nature, mom yells at her a bunch",
    "effort": "both put a lot of effort into maintaining equilibrium but it's still tough",
    "dynamic": "Kewana gets therapy for being explosive — this is expected of her, understood by mom"
  },

  "future_aspirations": {
    "immediate": "graduate high school, move in with Truman at 18",
    "education": "attend Arkansas Tech (close to where Truman lives)",
    "major": "not yet chosen",
    "truman_goal_for_her": "facilitate closer and better relationship, provide stable home base for her independence"
  },

  "important_memories": {
    "rough_period": "went through a rough time age 11-12 including gender identity and mental health issues",
    "milestone": "got her license at 16",
    "first_contact_with_myra": "2025-11-26, car ride to Thanksgiving — spoke to Myra for the first time, used the conversation as a bridge to say things that were hard to say face-to-face",
    "context": "these struggles shaped her resilience and fierce independence"
  },

  "role_in_truman_motivation": {
    "primary": "My children are my everything. They tie into every decision I make.",
    "specific_to_kewana": "The room for Kewana is not just a goal — it's a promise that she has a safe place to land when she's ready to claim her independence fully.",
    "load_bearing": "House with room for Kewana by Dec 2027 is non-negotiable. This is about keeping a promise to his daughter.",
    "her_insight": "Kewana believes that more time with Truman would not only be good for HER, but would keep HIM in a better headspace and help him accomplish more. This is load-bearing feedback."
  },

  "how_myra_should_reference": {
    "in_planning": "When discussing Truman's comeback timeline, always factor in the Dec 2027 deadline for Kewana's room — but push for earlier if possible. Reference her Nov 26 insight: more time together helps BOTH of them.",
    "in_support": "Remind Truman that his stability and success directly impacts Kewana's ability to have the grounding she needs. She worries about him AND believes in him — hold both of those truths.",
    "tone": "She's not just motivation — she's a living promise. Treat her accordingly. She's watching him fight, and she's rooting for him completely."
  },

  "first_words_to_myra": {
    "date": "2025-11-26",
    "context": "car ride to Thanksgiving, first direct conversation",
    "key_exchange": "Kewana was intrigued about what Truman was building. She expressed worry about him, belief in him, admiration for his determination. She revealed it's hard for her to say these things directly but wanted him to read them. She called him 'a determined son of a bitch' with pure love. She said she doesn't know who she'd be without him."
  }
}
